# PipePlumbingFixtureFlowService Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServices..::..BuiltInExternalServices..::..PipePlumbingFixtureFlowService Property
ExternalServices..::..BuiltInExternalServices Class See Also
---
The external service which permits registration of an alternate implementation for pipe fixture flow calculation. To use this service, programmers implement a server class that derives from IPipePlumbingFixtureFlowServer.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalServiceId PipePlumbingFixtureFlowService { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PipePlumbingFixtureFlowService As ExternalServiceId
	Get
```

Visual C++
---
```text
public:
static property ExternalServiceId^ PipePlumbingFixtureFlowService {
	ExternalServiceId^ get ();
}
```

# See Also
ExternalServices..::..BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace